{"category_product": "BABY-G", "introduce_product": "From BABY-G, the casual watch for active women, come new collaboration models based on the HELLO KITTY \"pink quilt\" motif that was so much a part of the girl culture of the 1990s. 2019 is the 45th anniversary of HELLO KITTY and the 25th anniversary of BABY-G, and these special collaboration models mark these occasions with retro 90s BABY-G designs combined with the HELLO KITTY pink quilt look. The faces of the watches feature the stitching patterns of the pink quilt motif while the letter \"B\" at the 25th minute commemorates BABY-G's 25th anniversary, and a HELLO KITTY face at the 45th minute marks its 45th anniversary. The face is also decorated with metallic flowers for a brilliant adult design. The back covers of these models are impressed with an original HELLO KITTY character that has a watch dial face and is wearing earrings with a flower motif that was iconic of HELLO KITTY in the 90s. These models come with an original pink quilt pouch and a watch stand that which lets you enjoy displaying your watch when you are not wearing it. These exciting new special models are a great way to celebrate the anniversaries of both HELLO KITTY and BABY-G.", "list_spec_icon": [{"spec_icon": "Shock Resistant", "detail_spec_icon": null}, {"spec_icon": "Daily Alarm", "detail_spec_icon": null}, {"spec_icon": "1 Second Stopwatch", "detail_spec_icon": null}], "price_product": "130.00", "name_product": "BGA150KT-7B", "url_product": "https://www.casio.com/products/watches/baby-g/bga150kt-7b", "list_specification_product": ["12/24-hour format", "1-second stopwatch", "Measuring capacity: 59'59", "Measuring mode: Elapsed time, split time, 1st-2nd place times", "Accuracy: ±30 seconds per month", "Approx. battery life", "3 Years on CR 1220", "Full auto-calendar (to year 2039)", "Countdown timer", "Measuring Unit: 1 second", "Countdown range: 60 minutes", "Countdown start time setting range: 1 to 60 minutes (1-minute increments)", "Others: Auto-repeat, progress beeper", "5 daily alarms (with 1 snooze alarm)", "Hourly time signal", "LED Light", "Selectable illumination duration (1.5 seconds or 3 seconds), afterglow", "Regular timekeeping", "Analog: 2 hands (Hour, minute (hand moves every 20 seconds))", "Digital: Hour, minute, second, pm, month, date, day", "Shock resistant", "Size of case / total weight", "BGA-150KT ...... 47.5 x 42.8 x 12.8 mm / 43 g"], "list_product_together_color": []}